Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཚངས་པ་ཀུན་འཁོར་དང་ཚངས་ཆེན་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་བར་གྱི་ལྷ་རྣམས་ཡོད་དོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་ཡོད་དོ། །སྟོང་པ་ཉིད་ཐམས་ཅད་ཡོད་དོ། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོད་དོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཡོད་དོ།
en: If you ask why, Kauśika, all attributes are extensively revealed through this perfection of wisdom, and it is owing to these that the members of great and lofty royal families are discerned; the members of great and lofty priestly families and the members of great and lofty householder families are discerned; the gods of the Caturmahā­rāja­kāyika realm are discerned; the gods of the Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin realms are discerned; and the gods of the Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, and other realms, up to and including Akaniṣṭha, are discerned, as well as the gods of the sphere of infinite space and the other spheres, up to and including the sphere of neither perception nor nonperception. [

source: །རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཡོད་དོ། །རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཡོད་དོ། །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཡོད་དོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཡོད་དོ།
en: Likewise], all the perfections are discerned; all the aspects of emptiness are discerned; the thirty-seven factors conducive to enlightenment are discerned; the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions are discerned; the eight aspects of liberation and the nine serial steps of meditative absorption are discerned; the three gateways of liberation and the extrasensory powers are discerned; the meditative stabilities and the dhāraṇī gateways are discerned; and the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are discerned. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོད་དོ།
en: Likewise, the fruits], up to and including all-aspect omniscience, are discerned. [

source: །རྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་རྣམས་ཡོད་དོ།
en: Likewise], those who have entered the stream to nirvāṇa, those destined for only one more rebirth, those who will no longer be reborn, arhats, and pratyekabuddhas are discerned. [

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོད་དོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཡོད་དོ།
en: Likewise], bodhisattva great beings are discerned, and the tathāgatas, arhats, completely awakened buddhas are discerned. “

source: །ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་རྣམས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པ་དང་། རང་བྱང་ཆུབ་ཀྱི་བར་ལ་བཀོད་པ་ལྟ་ཞོག་གི། ཀཽ་ཤི་ཀ་གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལས། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Kauśika, leaving aside the [aforementioned] establishing of the beings of Jambudvīpa in the paths of the ten virtuous actions and the establishing of them [in other goals], up to and including individual enlightenment, Kauśika, if any noble sons or noble daughters were to establish the beings of the world system of the four continents, as many as there are, in the paths of the ten virtuous actions, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase greatly on that basis?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ།
en: he replied. “

source: རིགས་ཀྱི་བུ་མོ་གང་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་གླེགས་བམ། ཀླག་པ་དང་། བྲི་བ་དང་། ཁ་ཏོན་དུ་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར།
en: Kauśika,” continued the Blessed One, “compared to them, if any noble sons or noble daughters give this book of the perfection of wisdom to others in order that they might recite it, commit it to writing, and chant it, their merit will increase even more.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལས་སྐྱེས་པ་ནི། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཐམས་ཅད་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་དོ། །ཀཽ་ཤི་ཀ་གླིང་ཆེན་པོ་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་རྣམས།
en: If you ask why, Kauśika, it is because all the attributes of the śrāvakas, pratyekabuddhas, and bodhisattvas, and all the attributes of the buddhas, arise from the perfection of wisdom. “

source: དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པ་དང་། རང་བྱང་ཆུབ་ཀྱི་བར་ལ་བཀོད་པ་ལྟ་ཞོག་གི། ཀཽ་ཤི་ཀ་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱུར་བུའི་སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལས། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད།
en: Kauśika, leaving aside the [aforementioned] establishing of the beings of the world system of the four continents in the paths of the ten virtuous actions and the establishing of them [in the other goals], up to and including individual enlightenment, Kauśika, if any noble sons or noble daughters were to establish the beings of the confined chiliocosm, as many as they are, in the paths of the ten virtuous actions and establish them [in the other goals], up to and including individual enlightenment, do you think, Kauśika, {Ki.

source: རང་བྱང་ཆུབ་ཀྱི་བར་ལ་རབ་ཏུ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: II-III: 106} that the merit of those noble sons or noble daughters would increase greatly on that basis?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་བ། ཀཽ་ཤི་ཀ་དེ་བས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་གིས།
en: he replied. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་གླེགས་བམ། ཀླག་པ་དང་། བྲི་བ་དང་། ཁ་ཏོན་དུ་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན། བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །ཀཽ་ཤི་ཀ་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་བྱུར་བུ་ལྟ་ཞོག་གི། ཀཽ་ཤི་ཀ་སྟོང་གཉིས་པ་འཇིག་རྟེན་གྱི་ཁམས། འབྲིང་པོའི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག །
en: Kauśika,” continued the Blessed One, “compared to them, if any noble sons or noble daughters give this book of the perfection of wisdom to others in order that they might recite it, commit it to writing, and chant it, their merit will increase even more. “

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལས། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་པ་དང་། རང་བྱང་ཆུབ་ཀྱི་བར་ལ་རབ་ཏུ་བཀོད་པ་ན་ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Kauśika, leaving aside the confined chiliocosm, Kauśika, if any noble sons or noble daughters were to establish the beings of the medium dichiliocosm, as many as they are, in the paths of the ten virtuous actions and establish them [in the other goals], up to and including individual enlightenment, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase greatly on that basis?” “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་གླེགས་བམ། བྲི་བ་དང་། ཀླག་པ་དང་། ཁ་ཏོན་དུ་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན། བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །ཀཽ་ཤི་ཀ་སྟོང་གཉིས་པ། འཇིག་རྟེན་གྱི་ཁམས་འབྲིང་པོ་ལྟ་ཞོག་གི། ཀཽ་ཤི་ཀ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག །
en: Kauśika,” continued the Blessed One, “compared to them, if any noble sons or noble daughters give this book of the perfection of wisdom to others in order that they might commit it to writing, recite it, and chant it, their merit will increase even more. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་གླེགས་བམ། བྲི་བ་དང་། ཀླག་པ་དང་། ཁ་ཏོན་དུ་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན། བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །ཀཽ་ཤི་ཀ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལྟ་ཞོག་གི། ཀཽ་ཤི་ཀ་ཕྱོགས་བཅུའི་ཕྱོགས་རེ་རེ་ཞིང་།
en: Kauśika,” continued the Blessed One, “compared to them, if any noble sons or noble daughters give this book of the perfection of wisdom to others in order that they might commit it to writing, recite it, and chant it, their merit will increase even more. “

source: འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་དག་ན། སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་ལ་ལས། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་པ་དང་། རང་བྱང་ཆུབ་ཀྱི་བར་ལ་རབ་ཏུ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Kauśika, leaving aside the great trichiliocosm, Kauśika, if any noble sons or noble daughters were to establish all the beings of the world systems in each of the ten directions, numerous as the grains of sand of the river Gaṅgā, in the paths of the ten virtuous actions and establish them [in the other goals], up to and including individual enlightenment, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase greatly on that basis?” “

source: གསོལ་བ། བཅོམ་ལྡན་འདས་མང་ངོ་།
en: It would, Blessed Lord!

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་གླེགས་བམ། བྲི་བ་དང་། ཀླག་པ་དང་། ཁ་ཏོན་དུ་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན། བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Kauśika,” continued the Blessed One, “compared to them, if any noble sons or noble daughters give this book of the perfection of wisdom to others in order that they might commit it to writing, recite it, and chant it, their merit will increase even more. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས། ཟག་པ་མེད་པའི་ཆོས་རྣམས་རྒྱ་ཆེར་བསྟན་ཏེ། དེ་དག་བསླབས་ཤིང་། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ད་ག །ཡང་དག་པའི་སྐྱོན་མེད་པར་ཞུགས་པར་འགྱུར་རོ། །འཇུག་གོ།
en: If you ask why, Kauśika, it is because the uncontaminated attributes are extensively revealed in this perfection of wisdom.

source: །འཇུག་པར་འགྱུར་རོ། །དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དུ་ཐོབ་པར་གྱུར་ཏོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ། །རང་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ཏོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ།
en: Training in these, noble sons and noble daughters have entered, will enter, and are entering into authentic maturity; they have attained, will attain, and are attaining [the fruits], up to and including arhatship; and they have attained, will attain, and are attaining individual enlightenment. [

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་པར་གྱུར་ཏོ། །འཇུག་གོ། །འཇུག་པར་འགྱུར་རོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ།
en: Training in these], bodhisattva great beings also have entered, will enter, and are entering into the maturity of the bodhisattvas, and they have attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment. “

source: །ཀཽ་ཤི་ཀ་ཟག་པ་མེད་པའི་ཆོས། དེ་དག་ཀྱང་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་བ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: Kauśika, if you ask what are these uncontaminated attributes, {Ki.

source: རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་།
en: II-III: 107} they comprise the perfections, the emptiness of internal phenomena and [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways of liberation, the six extrasensory powers, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the other attributes, up to and including the eighteen distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དང་། སངས་རྒྱས་ཀྱི་ཆོས་ཚད་མེད་པའི་བར་གཞན་དག་ཀྱང་རྒྱ་ཆེར་བསྟན་ཏོ། །ཀཽ་ཤི་ཀ་རྣམ་གྲངས་དེས་ཀྱང་།
en: There are also other immeasurable attributes of the buddhas that are extensively revealed. “

source: རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་གིས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གླེགས་བམ་དུ་བྲིས་ཤིང་། ཀླག་པ་དང་། བྲི་བ་དང་། ཁ་ཏོན་དུ་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན། དེ་བས་འདིའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་བར་ཤེས་པར་བྱའོ།
en: Kauśika, as this formulation also explains, you should know that if there are any noble sons or noble daughters who make this perfection of wisdom into a book and give it to others in order that they might recite it, commit it to writing, and chant it, their merit will increase even more than the aforementioned.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཆོས་ཐམས་ཅད་རྒྱ་ཆེར་བསྟན་ཏེ། དེ་དག་ཡོད་པས་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་དང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཡོད་དོ། །སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་།
en: If you ask why, Kauśika, it is because all attributes are extensively revealed through this perfection of wisdom, and it is owing to these that the members of great and lofty royal families, the members great and lofty priestly families, the members of great and lofty householder families, and the gods of the Caturmahā­rāja­kāyika realm are discerned. [

source: ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། འོག་མིན་གྱི་བར་གྱི་ལྷ་རྣམས་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་བར་གྱི་ལྷ་རྣམས་ཡོད་དོ།
en: Likewise], the gods of the Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin realms, and the gods of the Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, and other realms, up to and including Akaniṣṭha, are discerned, as well as the gods of the sphere of infinite space and the other spheres, up to and including the sphere of neither perception nor nonperception. [

source: །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་ཡོད་དོ། །ནང་སྟོང་པ་ཉིད་ཡོད་དོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡོད་དོ། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོད་དོ། །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་ཡོད་དོ།
en: Likewise], the perfections are discerned, the emptiness of internal phenomena and [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are discerned, the thirty-seven factors conducive to enlightenment are discerned, and [all the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas, are discerned. [

source: ཐམས་ཅད་ཤེས་པ་ཉིད་ཡོད་དོ། །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོད་དོ། །རྒྱུན་དུ་ཞུགས་པ་རྣམས་ཡོད་དོ།
en: Likewise], knowledge of all the dharmas is discerned, knowledge of the path is discerned, and all-aspect omniscience is discerned.

source: །ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་རྣམས་ཡོད་དོ།
en: Those who have entered the stream to nirvāṇa, those destined for only one more rebirth, those who will no longer be reborn, arhats, and pratyekabuddhas are discerned. [

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡོད་དོ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོད་དོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་འཛམ་བུའི་གླིང་གི་མི་ཇི་སྙེད་པ་དེ་དག་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ལ་ལས། བསམ་གཏན་བཞི་ལ་བཀོད།
en: Likewise], bodhisattva great beings are discerned, and the tathāgatas, arhats, completely awakened buddhas are discerned. “

source: ཚད་མེད་པ་བཞི་ལ་བཀོད། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ལ་བཀོད། མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Moreover, Kauśika, if any noble sons or noble daughters were to establish the human beings of Jambudvīpa, as many as there are, in the four meditative concentrations, establish them in the four immeasurable attitudes, establish them in the four formless absorptions, and establish them in the five extrasensory powers, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase greatly on that basis?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་གིས།
en: he replied. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་གླེགས་བམ། ཀླག་པ་དང་། བྲི་བ་དང་། ཁ་ཏོན་དུ་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན། བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Kauśika,” continued the Blessed One, “compared to them, if any noble sons or noble daughters give this book of the perfection of wisdom to others in order that they might recite it, commit it to writing, and chant it, their merit will increase even more.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་ཆོས་ཐམས་ཅད་རྒྱ་ཆེར་བསྟན་ཏོ། །ཀཽ་ཤི་ཀ་འཛམ་བུའི་གླིང་ལྟ་ཞོག །གླིང་ཆེན་པོ་བཞིའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱང་ལྟ་ཞོག །སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱང་ལྟ་ཞོག །སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱང་ལྟ་ཞོག །སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ལྟ་ཡང་ཞོག་གི་ཀཽ་ཤི་ཀ་ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་ཇི་སྙེད་པ་དང་། ལྷོ་དང་། ནུབ་དང་། བྱང་དང་། བྱང་ཤར་དང་། ཤར་ལྷོ་དང་། ལྷོ་ནུབ་དང་། ནུབ་བྱང་དང་། འོག་དང་། སྟེང་གི་ཕྱོགས་ཀྱི་ཕྱོགས་རེ་རེ་ཞིང་།
en: If you ask why, Kauśika, it is because all attributes are extensively revealed in this perfection of wisdom. “

source: འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག །རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ལ་ལས། བསམ་གཏན་བཞི་ལ་བཀོད། ཚད་མེད་པ་བཞི་ལ་བཀོད། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ལ་བཀོད། མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་ན། ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Kauśika, leaving aside Jambudvīpa, leaving aside the world system of the four continents, leaving aside the chiliocosm, leaving aside the dichiliocosm, and leaving aside the great trichiliocosm, Kauśika, if any noble sons or noble daughters were to establish all the beings of the world systems in the eastern direction, numerous as the grains of sand of the river Gaṅgā—and all the beings of the world systems in the southern, western, northern, northeastern, southeastern, southwestern, and northwestern directions, along with the nadir and the zenith, numerous as the grains of sand of the river Gaṅgā—in the four meditative concentrations, establish them in the four immeasurable attitudes, establish them in the four formless absorptions, and establish them in the five extrasensory powers, do you think, Kauśika, that the merit of those noble sons or noble daughters would increase greatly on that basis?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་བས་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་གིས།
en: he replied. “

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདིའི་གླགས་བམ། ཀླག་པ་དང་། བྲི་བ་དང་། ཁ་ཏོན་དུ་བྱ་བའི་ཕྱིར་གཞན་ལ་བྱིན་ན། བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: Kauśika,” continued the Blessed One, “compared to them, if any noble sons or noble daughters give a book of this perfection of wisdom to others in order that they might recite it, commit it to writing, and chant it, their merit will increase even more.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས། ཟག་པ་མེད་པའི་ཆོས་རྣམས་རྒྱ་ཆེར་བསྟན་ཏེ། དེ་དག་ལ་བསླབས་ཤིང་། རིགས་ཀྱི་བུའམ།
en: If you ask why, Kauśika, it is because the uncontaminated attributes are extensively revealed in this perfection of wisdom. “

source: རིགས་ཀྱི་བུ་མོ་དག་ཡང་དག་པའི་སྐྱོན་མེད་པར་ཞུགས་པར་གྱུར་ཏོ། །འཇུག་གོ། །འཇུག་པར་འགྱུར་རོ། །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་པར་གྱུར་ཏོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ། །དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དུ་ཐོབ་པར་གྱུར་ཏོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ། །རང་བྱང་ཆུབ་ཐོབ་པར་གྱུར་ཏོ། །འཐོབ་བོ། །ཐོབ་པར་འགྱུར་རོ།
en: Training in these, noble sons and noble daughters have entered, will enter, and are entering into authentic maturity; they have attained, will attain, and are attaining the fruit of entering the stream to nirvāṇa; they have attained, will attain, and are attaining [the other fruits], up to and including arhatship; and they have attained, will attain, and are attaining individual enlightenment. [

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་པར་གྱུར་ཏོ། །འཇུག་གོ། །འཇུག་པར་འགྱུར་རོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ། །ཀཽ་ཤི་ཀ་གཞན་ཡང་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་གྱི། འཛམ་བུའི་གླིང་གི་སེམས་ཅན་རྣམས་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་གྱི་སེམས་ཅན་དང་། ཕྱོགས་བཅུ་ཀུན་གྱི་ཕྱོགས་རེ་རེ་ཞིང་།
en: Training in these], bodhisattva great beings also have entered, will enter, and are entering into the maturity of the bodhisattvas, and they have attained, will attain, and are attaining consummate buddhahood in unsurpassed, complete enlightenment. “

source: འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི། སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག །དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་བཀོད་པ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་ལ་བཀོད་པས་ནི་མ་ཡིན་ནོ།
en: Moreover, Kauśika, if any noble sons or noble daughters were to take up, uphold, recite, master, and focus their attention correctly on this perfection of wisdom their merit would greatly increase, more so than those who establish the beings of Jambudvīpa, the beings of [other worlds], up to and including the great trichiliocosm, and the beings of the world systems in each of all the ten directions, numerous as the grains of sand of the river Gaṅgā, in the paths of the ten virtuous actions, and establish them in the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, and the five extrasensory powers. “

source: །དེ་ལ་ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་ནི་འདི་ཡིན་ཏེ། གཉིས་ལ་སྤྱོད་པ་ཡང་མ་ཡིན། མི་གཉིས་པ་ལ་སྤྱོད་པ་ཡང་མ་ཡིན་པའི་བློས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། འཆང་བ་དང་།
en: In this regard, focussing the attention correctly entails that the mind, without engaging in duality and without engaging in nonduality, takes up, upholds, recites, masters, and focuses the attention correctly on this perfection of wisdom.

source: ཀློག་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའོ། །གཉིས་ལ་སྤྱོད་པ་ཡང་མ་ཡིན། མི་གཉིས་པ་ལ་སྤྱོད་པ་ཡང་མ་ཡིན་པའི་བློས། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: It entails that the mind, without engaging in duality and without engaging in nonduality, takes up, upholds, recites, masters, and focuses the attention correctly on the perfection of meditative concentration, {Ki.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འཛིན་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་།
en: II-III: 108} the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity.

source: ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པའོ། །གཉིས་ལ་སྤྱོད་པ་ཡང་མ་ཡིན། མི་གཉིས་པ་ལ་སྤྱོད་པ་ཡང་མ་ཡིན་པའི་བློས། ནང་སྟོང་པ་ཉིད་འཛིན་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། འཆང་བ་དང་།
en: It entails that the mind, without engaging in duality and without engaging in nonduality, takes up, upholds, recites, masters, and focuses the attention correctly on the emptiness of internal phenomena.
